{
  "stanzas": [
    {
      "lines": [
        {
          "number": 1,
          "text": "I cannot tell why He whom angels worship"
        },
        {
          "number": 2,
          "text": "Should set His love upon the souls of men,"
        },
        {
          "number": 3,
          "text": "Or why as Shepherd He should seek the wanderers,"
        },
        {
          "number": 4,
          "text": "To bring them back, they know not"
        },
        {
          "number": 5,
          "text": "how nor when."
        },
        {
          "number": 6,
          "text": "But this I know, that He was born of Mary"
        },
        {
          "number": 7,
          "text": "When Bethlehem’s manger was His only home,"
        },
        {
          "number": 8,
          "text": "And that He lived at Nazareth and laboured;"
        },
        {
          "number": 9,
          "text": "And so the Saviour, Saviour of the world, has come."
        }
      ],
      "number": 1
    },
    {
      "lines": [
        {
          "number": 1,
          "text": "I cannot tell how silently He suffered"
        },
        {
          "number": 2,
          "text": "As with His peace He graced this place of tears,"
        },
        {
          "number": 3,
          "text": "Nor how His heart upon the cross was broken,"
        },
        {
          "number": 4,
          "text": "The crown of pain to three and thirty years."
        },
        {
          "number": 5,
          "text": "But this I know He heals the broken hearted"
        },
        {
          "number": 6,
          "text": "And stays our sin and calms our lurking fear,"
        },
        {
          "number": 7,
          "text": "And lifts the burden from the heavy laden;"
        },
        {
          "number": 8,
          "text": "For still the Saviour, Saviour of the world, is here."
        }
      ],
      "number": 2
    },
    {
      "lines": [
        {
          "number": 1,
          "text": "I cannot tell how He will win the nations,"
        },
        {
          "number": 2,
          "text": "How He will claim His earthly heritage,"
        },
        {
          "number": 3,
          "text": "How satisfy the needs and aspirations"
        },
        {
          "number": 4,
          "text": "Of east and west, of sinner and of sage."
        },
        {
          "number": 5,
          "text": "But this I know, all flesh shall see His glory,"
        },
        {
          "number": 6,
          "text": "And He shall reap the harvest He has sown,"
        },
        {
          "number": 7,
          "text": "And some glad day His sun will shine in splendour"
        },
        {
          "number": 8,
          "text": "When He the Saviour, Saviour, of the world, is known."
        }
      ],
      "number": 3
    },
    {
      "lines": [
        {
          "number": 1,
          "text": "I cannot tell how all lands shall worship,"
        },
        {
          "number": 2,
          "text": "When at His biding every storm is stilled,"
        },
        {
          "number": 3,
          "text": "Or who can say how great the jubilation"
        },
        {
          "number": 4,
          "text": "When all our hearts with love for Him are filled."
        },
        {
          "number": 5,
          "text": "But this I know the skies shall sound His praises,"
        },
        {
          "number": 6,
          "text": "Ten thousand thousand human voices sing,"
        },
        {
          "number": 7,
          "text": "And earth to heaven, and heaven to earth will answer,"
        },
        {
          "number": 8,
          "text": "At last the Saviour, Saviour of the world, is King!"
        }
      ],
      "number": 4
    }
  ],
  "title": "I Cannot Tell Why"
}
