{
  "stanzas": [
    {
      "lines": [
        {
          "number": 1,
          "text": "Jesus, I my cross have taken, all to leave and follow Thee."
        },
        {
          "number": 2,
          "text": "All things else I have forsaken, Thou from hence my all shall be."
        },
        {
          "number": 3,
          "text": "Perish every fond ambition, all I’ve sought or hoped or known."
        },
        {
          "number": 4,
          "text": "Yet how rich is my condition! God and Heaven are still mine own."
        }
      ],
      "number": 1
    },
    {
      "lines": [
        {
          "number": 1,
          "text": "Let the world despise and leave me, they have left my Savior, too."
        },
        {
          "number": 2,
          "text": "Human hearts and looks deceive me; Thou art faithful, Thou art true."
        },
        {
          "number": 3,
          "text": "O, ‘tis not in grief to harm me, while thy love is left to me;"
        },
        {
          "number": 4,
          "text": "O, ‘twere not in joy to charm me, If that love be hid from me."
        }
      ],
      "number": 2
    },
    {
      "lines": [
        {
          "number": 1,
          "text": "Soul, then know thy full salvation; rise o’er sin, and fear, and care;"
        },
        {
          "number": 2,
          "text": "Joy to find in every station something still to do or bear:"
        },
        {
          "number": 3,
          "text": "Think what Spirit dwells within thee; Think what Father’s smiles are thine;"
        },
        {
          "number": 4,
          "text": "Think that Jesus died to win thee, child of heaven, canst thou repine?"
        }
      ],
      "number": 3
    },
    {
      "lines": [
        {
          "number": 1,
          "text": "Haste then on from grace to glory, armed by faith, and winged by prayer,"
        },
        {
          "number": 2,
          "text": "Heaven’s eternal day’s before thee, God’s own hand shall guide thee there."
        },
        {
          "number": 3,
          "text": "Soon shall close thy earthly mission, soon shall pass thy pilgrim days;"
        },
        {
          "number": 4,
          "text": "Hope soon change to glad fruition, faith to sight, and prayer to praise."
        }
      ],
      "number": 4
    }
  ],
  "title": "Jesus, I My Cross Have Taken"
}
